{
  "categories": [
    {
      "id": 1,
      "name": "Politics"
    },
    {
      "id": 2,
      "name": "Sports"
    },
    {
      "id": 3,
      "name": "Entertainments"
    },
    {
      "id": 4,
      "name": "Technologies"
    },
    {
      "id": 5,
      "name": "News"
    }
  ],
  "news": [
    {
      "id": 1,
      "categoryId": 2,
      "title": "'Man up' and face scrutiny, Hunt tells Johnson",
      "description": "Jeremy Hunt said he was \"not interested\" in Boris Johnson's private life, but challenged him to a TV debate.",
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/17C79/production/_107510479_compositehuntjohnson.jpg",
      "publishedAt": "2019-06-24T03:15:58Z",
      "content": "Jeremy Hunt has urged Tory leadership rival Boris Johnson not to be \"a coward\" about facing public scrutiny.\n\nMr Hunt said he was \"not interested\" in his private life but he should \"man up\" and debate with him on TV this week.\n\nMeanwhile, Mr Johnson has warned the UK will face a \"democratic explosion\" if it does not leave the EU by 31 October.\n\nBut Mr Hunt challenged him to reveal whether he would call a general election if MPs refused to allow the UK to leave without a deal on that date.\n\nAfter Prime Minister Theresa May failed to get her Brexit deal through Parliament earlier this year, the date of the UK's departure for the EU was moved to 31 October.\n\n'Attacks'\nMr Johnson is under pressure to answer questions about a row with his partner in the early hours of Friday which led to police being called to his London home.\n\nThe Metropolitan Police has said it will not be taking any further action over the incident and his supporters have rallied around him. Former International Development Secretary Priti Patel told BBC Radio 4's Today programme a recording of the argument, given to the Guardian newspaper, was part of a \"politically-motivated series of attacks\".\n\n\"That is not the type of behaviour that you'd expect in our country, that's the type of behaviour associated with the old Eastern bloc,\" she added.\n\nMr Johnson refused to answer questions about the incident at a hustings event on Saturday, instead insisting his stance on Brexit was what mattered to the public and to the Conservative Party members who will choose the next leader."
    },
    {
      "id": 2,
      "categoryId": 5,
      "title": "India tent collapse kills 14, injures 50",
      "description": "Officials say some were electrocuted when storms caused a tent to collapse at a religious event.",
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/D6E3/production/_107511055_hi054844261.jpg",
      "publishedAt": "2019-06-24T02:40:33Z",
      "content": "At least 14 people were killed and more than 50 injured when heavy rain and strong winds caused a huge tent to collapse in the Indian state of Rajasthan on Sunday.\n\nSome were electrocuted by live wires as the tent caved in, and others killed by falling debris, Reuters reported.\n\nSome 300 people had gathered inside the tent for a religious event, the Hindustan Times newspaper reported.\n\nThe collapse took place in the Barmer district of the north-western state. The state's disaster management and relief minister Bhanwar Lal Meghwal questioned why organisers had not switched off the power supply in view of the wet weather.\n\nAn investigation has been launched into the incident.\n\nIndia's Prime Minister Narendra Modi called the incident \"unfortunate\" in a tweet on Sunday, saying his thoughts were \"with the bereaved families\"."
    },
    {
      "id": 3,
      "categoryId": 2,
      "title": "Rugby star's fundraiser shut down in anti-gay row",
      "description": "Israel Folau had sought donations to fight his sacking by Rugby Australia over social media posts.",
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/10D25/production/_107510986_9c2530d8-c12b-4157-98c7-2c952c1fe7f2.jpg",
      "publishedAt": "2019-06-24T01:51:16Z",
      "content": "A controversial fundraising page set up by sacked Australian rugby player Israel Folau has been shut down for promoting the exclusion of LGBT people, website GoFundMe says.\n\nFolau had his contract with Rugby Australia (RA) terminated in May after he said that \"hell awaits\" gay people.\n\nHe asked for public donations to help him with a legal fight against RA, arguing it dismissed him unlawfully.\n\nGoFundMe said the page violated its rules. All donations will be refunded.\n\n\"As a company, we are absolutely committed to the fight for equality for LGBTIQ+ people and fostering an environment of inclusivity,\" said spokeswoman Nicola Britton.\n\n\"While we welcome GoFundMe's engaging in diverse civil debate, we do not tolerate the promotion of discrimination or exclusion.\"\n\nFolau is a Christian who argues his contract termination was an act of religious discrimination.\n\nHe had received about A$760,000 (£414,000; $530,000) in donations since the page was set up last week, Australian media reported. RA terminated Folau's contract after saying he had breached behaviour standards \"including respectful use of social media\" by making anti-gay posts.\n\nEarlier this month, the star full-back filed a case against RA and Rugby New South Wales at the Fair Work Commission - Australia's national workplace relations tribunal."
    },
    {
      "id": 4,
      "categoryId": 3,
      "title": "Woman left alone on board parked plane in Canada",
      "description": "Tiffani Adams says she has experienced \"re-occurring night terrors\" since the incident.",
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/12B2E/production/_107509567_gettyimages-1130273721.jpg",
      "publishedAt": "2019-06-23T18:54:25Z",
      "content": "A woman has said she was left alone on an Air Canada plane after falling asleep during a flight.\n\nTiffani Adams said she fell asleep while flying from Quebec to Toronto on 9 June. When she woke up, she was freezing cold and still buckled into her seat, but the aircraft was parked.\n\nShe said she had experienced \"reoccurring night terrors\" since the incident took place.\n\nAir Canada has confirmed the incident occurred and is investigating.\n\nMs Adams said on Facebook that she woke up \"around midnight [a few hours after the flight landed] freezing cold still trapped in my seat in complete darkness.\"\n\nShe said the experience was \"terrifying\". Ms Adams managed to call her friend Deanna Dale to let her know where she was when her phone died less than a minute into the call.\n\nShe was unable to charge her phone as the plane had been shut down.\n\nMs Dale called Toronto Pearson Airport and told them of Ms Adams' whereabouts.\n\nWhile she was on board, Ms Adams managed to locate a torch in the cockpit of the plane and attempted to attract attention.\n\nShe was found by a luggage cart operator who she claimed was \"in shock\".\n\nMs Adams said that Air Canada staff offered her a limousine and a hotel but she declined, wanting to return home as quickly as possible.\n\nShe added that representatives from Air Canada had called her twice as part of the investigation and apologised."
    },
    {
      "id": 5,
      "categoryId": 5,
      "title": "Australian children rescued from Syria IS camp",
      "description": "The group include orphans of notorious Australian militant Khaled Sharrouf.",
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/FB86/production/_107509346_4ee97115-d1cc-4c19-a68c-5fc74b58b143.jpg",
      "publishedAt": "2019-06-23T18:21:09Z",
      "content": "Eight children, including six taken by their Australian parents to join the Islamic State (IS) group, have been evacuated from a Syrian refugee camp.\n\nThe group includes three orphaned children of notorious Australian militant Khaled Sharrouf.\n\nThe government was able to evacuate the children in secret in conjunction with aid groups, Australian media say.\n\nPrime Minister Scott Morrison confirmed they had been freed from a \"bleak and complicated'' situation.\n\n\"The fact that parents put their children into harm's way by taking them into a war zone was a despicable act,\" Mr Morrison said. \"However, children should not be punished for the crimes of their parents.\"\n\nHe added that the decision had not been made \"lightly\".\n\n\"Australia's national security and the safety of our people and personnel have always been our most important considerations in this matter,\" he said.\n\nEarlier this year he insisted he would not endanger lives to extract Australians from camps.\n\nFive children of Sharrouf were taken to Syria in 2014 by their mother, Tara Nettleton. She had followed her husband who had left months before on his brother's passport.\n\nSharrouf became notorious for graphic photographs he shared online from the warzone - including of his young children with weapons and one holding a severed head."
    },
    {
      "id": 6,
      "categoryId": 2,
      "title": "Women's World Cup 2019: England beat Cameroon in fiery encounter to reach quarter-finals",
      "description": "England beat Cameroon 3-0 in an extraordinary last-16 tie to set-up a Women's World Cup quarter-final with Norway.",
      "imageUrl": "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/3566/production/_107507631_england.jpg",
      "publishedAt": "2019-06-23T17:55:22Z",
      "content": "England progressed to the quarter-finals of the Women's World Cup with a 3-0 victory over an enraged Cameroon side who protested after two VAR decisions went against them.\n\nGoals from Steph Houghton, Ellen White and Alex Greenwood sent England through to face Norway on Thursday, but the fractious game will be remembered for Cameroon's extraordinary reactions to White's goal and a disallowed effort from Ajara Nchout.\n\nThe distraught Cameroon players twice appeared unwilling to restart the match, gathering in a huddle after White's strike was given and remonstrating with the officials further after half-time.\n\nCaptain Houghton struck England's opener after an early backpass gave England an indirect free-kick, before the drama escalated.\n\nStriker White placed in England's second, which was initially ruled out before the video assistant referee deemed White to have been onside, but Cameroon reacted furiously and gestured to suggest the big screen's replays had indicated differently.\n\nThe African side thought they had pulled a goal back after the break through Nchout, but their despair increased when it was disallowed after a VAR review for an extremely tight offside call.\n\nEngland left-back Greenwood then swept in the Lionesses' third to secure a win that saw them reach at least the last eight of the competition for a fifth time, and for the fourth consecutive World Cup."
    },
    {
      "id": 7,
      "categoryId": 1,
      "title": "Demonstrators rally against PM in Czech Republic",
      "description": "Protesters are calling for Prime Minister Andrej Babis to resign amid fraud allegations.",
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/4FF6/production/_107507402_054845019-1.jpg",
      "publishedAt": "2019-06-23T16:47:46Z",
      "content": "Hundreds of thousands of protesters have taken to the streets of Prague demanding that PM Andrej Babis resign.\n\nMr Babis is facing a criminal investigation over alleged fraud, and is also the subject of an EU conflict-of-interest investigation. He denies the allegations.\n\nOrganisers say about 250,000 people attended the rally. The figure could not be verified.\n\nIt is said to be the largest protest since the fall of communism in 1989.\n\nWho was marching?\nThe protest was organised by the Million Moments for Democracy group. The movement has grown from a small student initiative into a mass movement. The prime minister is facing a criminal investigation in the Czech Republic for alleged abuse of €2m in EU subsidies over 10 years ago.\n\nPolice say they are investigating accusations that Mr Babis hid his ownership of a farm and conference centre known as \"Stork Nest\" (Capi hnizdo in Czech) so that it could qualify for an EU subsidy designed to help small businesses.\n\nThe billionaire is also the subject of an EU conflict-of-interest investigation over his Agrofert conglomerate, which he transferred to two trust funds shortly before he came to power in 2017."
    },
    {
      "id": 8,
      "categoryId": 1,
      "title": "Turkey ruling party set to lose Istanbul election",
      "description": "Ruling party in Turkey set to lose city of Istanbul after re-run mayoral election in big blow for President Erdogan",
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/7A23/production/_97176213_breaking_news_bigger.png",
      "publishedAt": "2019-06-23T16:30:56Z",
      "content": "THE RULING PARTY candidate in the controversial re-run of Istanbul’s mayoral election has conceded defeat in a major blow for President Recep Erdogan. \n\nThe city returned to the polls today in a re-run of the mayoral election that was widely seen as a test of Turkish democracy as well as Erdogan’s continued popularity at a time of economic trouble.\n\nElection authorities annulled the first vote in March after Erdogan’s ruling party alleged corruption.\n\nCritics say Erdogan simply did not like the result, after a little-known former district mayor, 49-year-old Ekrem Imamoglu, snatched victory for the opposition by just 13,000 votes.\n\nInitial results from the state-run Anadolu news agency showed opposition candidate Ekrem Imamoglu leading with 53% to Binali Yildirim’s 45% with more than 95% of ballots counted. \n\n“According to the result as of now my competitor Ekrem Imamoglu is leading the race. I congratulate him and wish him good luck,” Yildirim said.\n\nThe city of 15 million is Turkey’s economic powerhouse and has been a crucial source of patronage for Islamic conservatives since Erdogan himself won the mayorship a quarter-century ago.\n\n‘A household name’\n\nImamoglu, of the secular Republican People’s Party, has become a household name since being stripped of his victory, depicting the rerun as “a battle for democracy”.\n\n“Today our people will make the best decision… for the sake of our democracy, for Istanbul and also for the legitimacy of all future elections,” he said after voting.\n\nHis upbeat message under the slogan “Everything will be fine” is in contrast to the usual aggressive name-calling of Turkish politics.\n\nImamoglu faced Yildirim, a mild-mannered Erdogan loyalist who oversaw several huge transport projects and served as prime minister."
    },
    {
      "id": 9,
      "categoryId": 1,
      "title": "Why police are hunting a group of US state senators",
      "description": "Republicans from Oregon have been missing since walking out over a climate change law on Thursday.",
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/0884/production/_107508120_gettyimages-507449350.jpg",
      "publishedAt": "2019-06-23T15:45:26Z",
      "content": "Eleven Republican senators from the state of Oregon are in hiding.\n\nThey walked out of Salem's Capitol building on Thursday and state police have been given authorisation to track them down.\n\nThis bizarre series of events has unfolded amid a deep rift between the state's rival parties.\n\nOregon's Democrats, who have a clear Senate majority, want to pass landmark climate change legislation. Local Republicans have fled to stop that happening.\n\nThis weekend, the state capitol had to shut down altogether amid apparent security threats from militia groups.\n\nWhy did the politicians flee?\nOregon Democrats are trying to become the second US state to pass an ambitious \"cap and trade\" climate plan.\n\nHouse Bill 2020 would set overall limits on state carbon emissions, with permits or allowances auctioned off to polluting industries.\n\nThe plan aims to encourage businesses to switch to green technology, with the goal of slashing emissions to 80% below 1990 levels by 2050.\n\nUnder it, petrol and diesel prices are expected to go up. Republicans say these changes will disproportionally affect rural Oregonians, like farm workers and loggers. They argue the plan should be referred to a state-wide ballot so \"every Oregonian has a voice\"."
    },
    {
      "id": 10,
      "categoryId": 1,
      "title": "Trump threatens reporter with prison over photo",
      "description": "\"What was that?!\" the president snaps as an Oval Office reporter apparently oversteps his bounds.",
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/583B/production/_107478522_gettyimages-1142455614.jpg",
      "publishedAt": "2019-06-21T13:44:09Z",
      "content": "US President Donald Trump threatened a Time magazine photographer with prison for apparently taking a picture of a letter from Kim Jong-un.\n\nMr Trump rebuked the photographer in the Oval Office after he was warned by an aide not to take a photo, according to Time's transcript.\n\nThe interview continued, but grew heated after the special counsel's investigation of Mr Trump came up.\n\n\"You can go to prison instead,\" the president is quoted as saying.\n\nThe interview took place at the White House on Monday, two days before Mr Trump travelled to Florida to formally launch his 2020 re-election campaign.\n\n'Why we want Trump to win in 2020'\nAt several points during the interview, Mr Trump asked to speak off-the-record, including in the moments after showing the Time reporters a letter he said was from the leader of North Korea.\n\n\"Here's a letter, OK, now I'm going to show you this letter,\" said the Republican president.\n\n\"So this was written by Kim Jong-un. It was delivered to me yesterday. By hand.\"\n\nAs the conversation turned to his potential Democratic challengers in next year's election, White House press secretary Sarah Sanders told the journalists: \"You can't take a picture of that, sorry.\"\n\n\"What was that?!\" Mr Trump exclaims.\n\nThe interview continues as the reporters ask about who Mr Trump sees as his toughest political opponent for 2020.\n\n\"Uh, I don't know. Look, I think I've done so much. Could you bring the list of things, please, give me four of them,\" Mr Trump tells an aide, who quickly presents one, saying it was made \"for today\".\n\nThe president becomes more prickly when Time challenges an assertion by him, according to the transcript."
    }
  ]
}